cmsis-svd/cmsis-svd/data/Fujitsu/MB9BF61xS.xml
        <!-- REGISTER "UPINT_CLR" -->
        <register>
          <name>UPINT_CLR</name>
          <description>USB/Ethernet-PLL Interrupt Source Clear Register</description>
          <addressOffset>0x1C</addressOffset>
          <size>8</size>
          <access>write-only</access>
          <resetValue>0x00</resetValue>
          <resetMask>0x01</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "UPCSC" -->
            <field>
              <name>UPCSC</name>
              <description>USB/Ethernet-PLL oscillation stabilization interrupt source clear bit </description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "USBEN0" -->
        <register>
          <name>USBEN0</name>
          <description>USB0 Enable Register</description>
          <addressOffset>0x30</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0x01</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "USBEN0" -->
            <field>
              <name>USBEN0</name>
              <description>USB0 enable bit </description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "USBEN1" -->
        <register>
          <name>USBEN1</name>
          <description>USB1 Enable Register</description>
          <addressOffset>0x34</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0x01</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "USBEN1" -->
            <field>
              <name>USBEN1</name>
              <description>USB1 enable bit</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
      </registers>
    </peripheral>
    <!-- PERIPHERAL "USB0" -->
    <peripheral>
      <name>USB0</name>
      <description>USB0 Function</description>
      <groupName>USB0</groupName>
      <baseAddress>0x40040000</baseAddress>
      <!-- ADDRESS BLOCK -->
      <addressBlock>
        <offset>0x2100</offset>
        <size>0x2</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x2104</offset>
        <size>0x2</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x2108</offset>
        <size>0x2</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x210C</offset>
        <size>0x2</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x2110</offset>
        <size>0x2</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x2114</offset>
        <size>0x2</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x2118</offset>
        <size>0x2</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x211C</offset>
        <size>0x1</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x2120</offset>
        <size>0x2</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x2124</offset>
        <size>0x2</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x2128</offset>
        <size>0x2</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x212C</offset>
        <size>0x2</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x2130</offset>
        <size>0x2</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x2134</offset>
        <size>0x2</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x2138</offset>
        <size>0x2</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x213C</offset>
        <size>0x2</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x2140</offset>
        <size>0x2</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x2144</offset>
        <size>0x2</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x2148</offset>
        <size>0x2</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x214C</offset>
        <size>0x2</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x2150</offset>
        <size>0x2</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x2154</offset>
        <size>0x2</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x2158</offset>
        <size>0x2</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x215C</offset>
        <size>0x2</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x2160</offset>
        <size>0x2</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x2164</offset>
        <size>0x2</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x2168</offset>
        <size>0x2</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x216C</offset>
        <size>0x2</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x2170</offset>
        <size>0x2</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x2174</offset>
        <size>0x2</size>
        <usage>registers</usage>
      </addressBlock>
      <!-- INTERRUPT "USB0F" -->
      <interrupt>
        <name>USB0F</name>
        <value>34</value>
      </interrupt>
      <!-- INTERRUPT "USB0F_USB0H" -->
      <interrupt>
        <name>USB0F_USB0H</name>
        <value>35</value>
      </interrupt>
      <!-- REGISTERS -->
      <registers>
        <!-- REGISTER "UDCC" -->
        <register>
          <name>UDCC</name>
          <description>UDC Control Register</description>
          <addressOffset>0x2120</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x00A0</resetValue>
          <resetMask>0x00FB</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "RST" -->
            <field>
              <name>RST</name>
              <description>Function Reset bit</description>
              <lsb>7</lsb>
              <msb>7</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "RESUM" -->
            <field>
              <name>RESUM</name>
              <description>Resume Setting bit </description>
              <lsb>6</lsb>
              <msb>6</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "HCONX" -->
            <field>
              <name>HCONX</name>
              <description>Host Connection bit</description>
              <lsb>5</lsb>
              <msb>5</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "USTP" -->
            <field>
              <name>USTP</name>
              <description>USB Operating Clock Stop bit </description>
              <lsb>4</lsb>
              <msb>4</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "STALCLREN" -->
            <field>
              <name>STALCLREN</name>
              <description>Endpoint 1 to 5 STAL bit Clear Select bit </description>
              <lsb>3</lsb>
              <msb>3</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "RFBK" -->
            <field>
              <name>RFBK</name>
              <description>Data Toggle Mode Select bit </description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "PWC" -->
            <field>
              <name>PWC</name>
              <description>Power Control bit </description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "EP0C" -->
        <register>
          <name>EP0C</name>
          <description>EP0 Control Register</description>
          <addressOffset>0x2124</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0040</resetValue>
          <resetMask>0x027F</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "STAL" -->
            <field>
              <name>STAL</name>
              <description>Endpoint 0 Stall Setting bit</description>
              <lsb>9</lsb>
              <msb>9</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "PKS0" -->
            <field>
              <name>PKS0</name>
              <description>Packet Size Endpoint 0 Setting bits</description>
              <lsb>0</lsb>
              <msb>6</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "EP1C" -->
        <register>
          <name>EP1C</name>
          <description>EP1 Control Register</description>
          <addressOffset>0x2128</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x6100</resetValue>
          <resetMask>0xFFFF</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "EPEN" -->
            <field>
              <name>EPEN</name>
              <description>Endpoint Enable bit</description>
              <lsb>15</lsb>
              <msb>15</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "TYPE" -->
            <field>
              <name>TYPE</name>
              <description>Endpoint Transfer Type Select bits</description>
              <lsb>13</lsb>
              <msb>14</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "DIR" -->
            <field>
              <name>DIR</name>
              <description>Endpoint Transfer Direction Select bit </description>
              <lsb>12</lsb>
              <msb>12</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "DMAE" -->
            <field>
              <name>DMAE</name>
              <description>DMA Automatic Transfer Enable bit</description>
              <lsb>11</lsb>
              <msb>11</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "NULE" -->
            <field>
              <name>NULE</name>
              <description>Null Automatic Transfer Enable bit</description>
              <lsb>10</lsb>
              <msb>10</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "STAL" -->
            <field>
              <name>STAL</name>
              <description>Endpoint Stall Setting bit </description>
              <lsb>9</lsb>
              <msb>9</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "PKS" -->
            <field>
              <name>PKS</name>
              <description>Packet Size Setting bits</description>
              <lsb>0</lsb>
              <msb>8</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
